content/projects.md
+++
title = "Projects"
author = ["Matthew Rothlisberger"]
lastmod = 2020-09-23T21:49:23-04:00
draft = false
weight = 2003
+++

This is a list of my personal projects. Many are engineering efforts
and some were undertaken for the sake of learning. I feel that all
those listed are notable enough to include for now, but some will be
removed in the future, and more will certainly be added.

Several of these projects are not yet completed to my satisfaction,
and I am continuing work on the ones that I consider most valuable.


## [This Website](https://github.com/asterane/asterane.github.io) {#this-website}

A personal homepage, blog, and portfolio website. Written from scratch
to be fast, clean, and responsive. Also see the
[colophon]({{< relref "colophon" >}}).


## [Processor Design](https://github.com/asterane/processor-design) {#processor-design}

Designing a custom sixteen bit central processing unit, and
constructing it out of discrete logic components.


## [The Grid](https://github.com/asterane/the-grid) {#the-grid}

[Readme forthcoming] Design through full implementation of a
completely custom LED display wall and software to control it,
measuring 12 feet high by 20 feet wide.


## [Analog Circuit Design](https://github.com/asterane/analog-design) {#analog-circuit-design}

Construction of a high fidelity 90 watt audio power amplifier. Also, a
voltage controlled oscillator design for frequency modulation.


## Real Time Digital Signal Processing {#real-time-digital-signal-processing}

[Repository forthcoming] Creating algorithms to correct audio
distortion from speakers and the environment. Written for processors
and FPGA.


## Raycasting Demonstration {#raycasting-demonstration}

[Repository forthcoming] Project to create a first person 3D game in
the style of Doom, using Java. Can move around single layer 3D
environment.


## Set Design {#set-design}

[Repository forthcoming] Design and construction of all sets for
several large theatrical shows. Used computer aided design.


## Robot Design {#robot-design}

[Repository forthcoming] Building the chassis for a custom wheeled
robot using cheap materials, and writing software for it.


## Emacs Configuration {#emacs-configuration}

[Repository forthcoming] My personal Emacs configuration file, with
all the customization I use to do my work from day to day.


## [C Exercises](https://github.com/asterane/c-exercises) {#c-exercises}

Practice programming using the low level C language, dealing with
memory management, and creating efficient code.


## Rust Exercises {#rust-exercises}

[Repository forthcoming] Learning the relatively new Rust systems
language and its many features characteristic of higher level
languages.


## [Python Exercises](https://github.com/asterane/python-exercises) {#python-exercises}

Early work learning how to program computers, as well as later efforts
in scripting various tasks.
